app/views/home/blog_list.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
                        <i class="fa-solid fa-user logout"></i>
                        <% logged_user=User.find(session[:user_id]) %>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
<%if session[:user_id] !=nil%>
 <% logged_user=User.find(session[:user_id]) %>