app/views/home/blog_create.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
                        <i class="fa-solid fa-user logout"></i>
                        <% logged_user=User.find(session[:user_id]) %>