app/views/home/comment.html.erb

    </div>
        <%BlogComment.where(new_blogs_id:@asw).each do |pg|%>
---
SELECT `blog_comments`.* FROM `blog_comments` WHERE `blog_comments`.`new_blogs_id` = 1