app/views/home/comment.html.erb

                        <i class="fa-solid fa-user logout"></i>
                        <% logged_user=User.find(session[:user_id]) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

    </div>
        <%BlogComment.where(new_blogs_id:@asw).each do |pg|%>
<div class="pg_review">
    <p class="rev_name"><%=User.find(pg.users_id).name%></p>
---
SELECT `blog_comments`.* FROM `blog_comments` WHERE `blog_comments`.`new_blogs_id` = 8
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1