app/views/home/update.html.erb

                        <i class="fa-solid fa-user logout"></i>
                        <% logged_user=User.find(session[:user_id]) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1