app/controllers/home_controller.rb

INSERT INTO `new_blogs` (`blog_title`, `blog_description`, `created_at`, `updated_at`, `users_id`) VALUES ('I am a foodie', 'world is full of wonderfull natures', '2022-09-23 07:06:19.591438', '2022-09-23 07:06:19.591438', 1)
---
  def create
    begin
      create_blog = NewBlog.new(user_params)
      create_blog[:users_id]=session[:user_id]
      comment = params[:id]
           if create_blog.save

SELECT `new_blogs`.* FROM `new_blogs`
---
  def blog_list
    begin
      @list_blog = NewBlog.all

SELECT `new_blogs`.* FROM `new_blogs` WHERE `new_blogs`.`id` = 1 LIMIT 1
---
  def comment
    begin
      if params[:id] != nil
        @@ary.insert(0, params[:id])
      end
      @showblogs = NewBlog.find(@@ary[0])

INSERT INTO `blog_comments` (`comment`, `created_at`, `updated_at`, `new_blogs_id`, `users_id`) VALUES ('just loved it', '2022-10-05 06:04:35.911734', '2022-10-05 06:04:35.911734', 1, 1)
---
  def comment_save
    begin
      comment= BlogComment.new(params.require(:comment).permit( :comment ))
    comment[:users_id]=session[:user_id]
    comment[:new_blogs_id]=@@ary[0]
  if comment.save

SELECT `new_blogs`.* FROM `new_blogs` WHERE `new_blogs`.`id` = 7 LIMIT 1
SELECT `blog_comments`.* FROM `blog_comments` WHERE `blog_comments`.`new_blogs_id` = 1
DELETE FROM `blog_comments` WHERE `blog_comments`.`id` = 1
DELETE FROM `new_blogs` WHERE `new_blogs`.`id` = 1
---
def destroy
  begin
    @del=NewBlog.find(params[:id])
  @com_del=BlogComment.where(new_blogs_id: @del.id)
  if @com_del.destroy_all

SELECT `new_blogs`.* FROM `new_blogs` WHERE `new_blogs`.`users_id` = 1
---
def my_blogs
  begin
    @items = NewBlog.where(users_id: current_user.id)

SELECT `new_blogs`.* FROM `new_blogs` WHERE `new_blogs`.`id` = 1 LIMIT 1
---
def update
 @newblog = NewBlog.find(params[:id])

SELECT `new_blogs`.* FROM `new_blogs` WHERE `new_blogs`.`id` = 1 LIMIT 1
UPDATE `new_blogs` SET `new_blogs`.`blog_description` = 'I am very happy to be intern in freshworks,It is a great opportunity to be a part in freshworks.Soon i will prove my talent in what i am selected.', `new_blogs`.`updated_at` = '2022-10-10 10:09:42.731431' WHERE `new_blogs`.`id` = 8
---
def update_blog
  @newblog = NewBlog.find(@@ary1[0])

  @newblog.update(update_params)