app/controllers/session_controller.rb

  def create
    begin
      user = User.find_by(email: user_params['email'])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'haiden@gmail.com' LIMIT 1