app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('anto', 'anto@gmail.com', '$2a$12$4tyFC.9Xb85yjlGx1f09m.d9s8AFlRmxVj4j4mKoJ9ru6aoJbustG', '2022-10-07 06:56:06.324045', '2022-10-07 06:56:06.324045')
---
  def create
    begin
      user = User.new(user_params)
      if user.save